docs/comp-sci/lisp/backquotes.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Backquotes - Lisp</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\DeclareMathOperator{\tr}{tr}
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
% For +---- metric
\newcommand{\BDpos}{}
\newcommand{\BDneg}{-}
\newcommand{\BDposs}{\phantom{-}}
\newcommand{\BDnegg}{-}
\newcommand{\BDplus}{+}
\newcommand{\BDminus}{-}
% For -+++ metric
\newcommand{\BDpos}{-}
\newcommand{\BDposs}{-}
\newcommand{\BDneg}{}
\newcommand{\BDnegg}{\phantom{-}}
\newcommand{\BDplus}{-}
\newcommand{\BDminus}{+}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Backquotes - Lisp</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-b18d5fb1-085d-4dd6-a5ad-08a2d47c3e93">1. Introduction</a></li>
<li><a href="#h-158b0f1a-1cae-415f-890f-b53237db1f4a">2. Basic Rules</a></li>
<li><a href="#h-15fb9b5a-3dd2-4f9a-bb8b-9a3d194548c0">3. Nested Backquotes</a>
<ul>
<li><a href="#h-77bde178-1a00-4477-981f-62ac5ee54991">3.1. Idiom: comma-quote-comma</a></li>
<li><a href="#h-79514d56-ea6d-4263-a2d1-626cafe84e6e">3.2. Nested Splicing</a></li>
</ul>
</li>
<li><a href="#h-6c738640-21a3-4a1c-8ad3-18cd9fbb1faa">4. Caution: Compiler Dependence</a></li>
<li><a href="#h-203674ea-a03f-45bf-9a94-6cb8bdc77f2e">5. References</a></li>
</ul>
</div>
</div>
<div id="outline-container-h-b18d5fb1-085d-4dd6-a5ad-08a2d47c3e93" class="outline-2">
<h2 id="h-b18d5fb1-085d-4dd6-a5ad-08a2d47c3e93"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-h-b18d5fb1-085d-4dd6-a5ad-08a2d47c3e93">
<p>
The idea is we want a sort of "parametrized quotation" or "template", where we
explicitly splice in lists or explicitly substitute in the values of
variables.
</p>

<p>
Where a comma appears, the form following the comma is to be evaluated
to produce an object to be inserted at that point. For example,
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">let</span> ((b 3))
  `(a b ,b ,(+ b 1) b))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; (a b 3 4 b)</span>
</pre>
</div>

<p>
If a comma is followed by <code>@</code> (an at-sign), then the form following the
at-sign is evaluated to produce a list of objects; this list is then
"spliced" into place in the template. For example,
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">let</span> ((x '(a b c)))
     `(x ,x      ,@x   foo ,(cadr x) bar ,(cdr x) baz ,@(cdr x)))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; (x (a b c) a b c foo b         bar (b c)    baz b c)</span>
</pre>
</div>

<p>
This is especially useful for macros. For example, from my <a href="https://github.com/pqnelson/cl-aim/blob/main/src/fol/thm.lisp">toy proof assistant</a>:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defmacro</span> <span class="org-function-name">defthm</span> (name params <span class="org-type">&amp;body</span> formula-body)
  `(<span class="org-keyword">progn</span>
     (<span class="org-keyword">defun</span> ,(intern (string name) 'cl-aim.fol.thm) ,params
       ,@formula-body)
     (export ',(intern (string name) 'cl-aim.fol.thm) 'cl-aim.fol.thm)))
</pre>
</div>

<p>
We can splice in a sublist using <code>,@my-list</code> to splice in the contents
of <code>my-list</code> into a backquoted expression.
</p>
</div>
</div>
<div id="outline-container-h-158b0f1a-1cae-415f-890f-b53237db1f4a" class="outline-2">
<h2 id="h-158b0f1a-1cae-415f-890f-b53237db1f4a"><span class="section-number-2">2.</span> Basic Rules</h2>
<div class="outline-text-2" id="text-h-158b0f1a-1cae-415f-890f-b53237db1f4a">
<p>
<i>Common Lisp: The Language</i> (&sect; 22.1.3) gives the following heuristic
rules governing backquotes:
</p>

<ul class="org-ul">
<li><code>`basic</code> is the same as <code>'basic</code> &#x2014; i.e., <code>(quote basic)</code> &#x2014; for any
form <code>basic</code> which is not a list or general vector</li>
<li><code>`,form</code> is the same as <code>form</code> for any <code>form</code> provided the
representation of <code>form</code> does not begin with either <code>@</code> or <code>.</code></li>
<li><code>`,@form</code> is an error</li>
<li><code>`(x1 x2 x3 ... xn . atom)</code> may be interpreted to mean
<code>(append [x1] [x2] [x3] ... [n] (quote atom))</code> where the brackets are
used to indicate a transformation of an \(x_{j}\) as follows:
<ul class="org-ul">
<li><code>form</code> is interpreted as <code>(list `form)</code> which contains a
backquoted form thatmust then be further interpreted</li>
<li><code>,form</code> is interpreted as <code>(list form)</code></li>
<li><code>,@form</code> is simply interpreted as <code>form</code></li>
</ul></li>
<li><code>`(x1 x2 ... xn)</code> is interpreted as <code>`(x1 x2 ... xn . nil)</code> and
reduces to the previous case</li>
<li><code>`(x1 x2 ... xn . ,form)</code> may be interpreted to mean
<code>`(append [x1] [x2] ... [xn] form)</code> where the brackets indicate a
transformation of an \(x_{j}\) as described above.</li>
<li><code>`(x1 x2 ... xn . ,@form)</code> is an error.</li>
<li><code>`#(x1 x2 ... xn)</code> may be interpreted to mean
<code>(apply #'vector `(x1 x2 ... xn))</code></li>
</ul>

<p>
No other uses of comma are permitted.
</p>

<p>
The use of <code>,.</code> is similar to <code>,@</code> except that <code>,.</code> is destructive,
using (for example) <code>nconc</code> instead of <code>append</code>.
</p>
</div>
</div>
<div id="outline-container-h-15fb9b5a-3dd2-4f9a-bb8b-9a3d194548c0" class="outline-2">
<h2 id="h-15fb9b5a-3dd2-4f9a-bb8b-9a3d194548c0"><span class="section-number-2">3.</span> Nested Backquotes</h2>
<div class="outline-text-2" id="text-h-15fb9b5a-3dd2-4f9a-bb8b-9a3d194548c0">
<p>
<b>Puzzle:</b> We want to return a backquoted expression from a function,
what do we do?
</p>

<p>
(This happens frequently in computer algebra systems or compilers.)
</p>

<p>
<b>Solution:</b> Double backquotes. What happens is that an "intermediate
backquotation" will be returned.
</p>

<p>
<b>Heuristic:</b> The "innermost" comma will be evaluated, leaving the
"outermost" comma in the returned "intermediate backquote".
</p>

<p>
Example of what a double backquote looks like:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">let</span> ((b <span class="org-builtin">:foobar</span>))
 ``(,A ,,B ,,17))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; `(,A ,:FOOBAR ,17)</span>
</pre>
</div>

<p>
We use double commas to produce an "expanded comma" expression. That is,
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">let</span> ((b 'spam))
 ``(,A ,,B ,,17))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; `(,A ,SPAM ,17)</span>
</pre>
</div>

<p>
We replace <code>B</code> with its value (this "consumes" one comma, prefixing the
value with a comma).
</p>
</div>
<div id="outline-container-h-77bde178-1a00-4477-981f-62ac5ee54991" class="outline-3">
<h3 id="h-77bde178-1a00-4477-981f-62ac5ee54991"><span class="section-number-3">3.1.</span> Idiom: comma-quote-comma</h3>
<div class="outline-text-3" id="text-h-77bde178-1a00-4477-981f-62ac5ee54991">
<p>
If we want to produce a quoted literal in the result, for example if <code>B</code>
were bound to a symbol, and we wanted to quote that symbol in the
result, we would do something like:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">let</span> ((b 'spam))
 ``(,A ,',B ,,17))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; `(,A ,'SPAM ,17)</span>
</pre>
</div>

<p>
This then evaluates the quote in the result &#x2014; that is, when we <i>use</i>
this backquoted expression, the second term <code>,'SPAM</code> evaluates to <code>SPAM</code>
as a symbol.
</p>
</div>
</div>
<div id="outline-container-h-79514d56-ea6d-4263-a2d1-626cafe84e6e" class="outline-3">
<h3 id="h-79514d56-ea6d-4263-a2d1-626cafe84e6e"><span class="section-number-3">3.2.</span> Nested Splicing</h3>
<div class="outline-text-3" id="text-h-79514d56-ea6d-4263-a2d1-626cafe84e6e">
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">let</span> ((b '(spam und eggs)))
 ``(,A ,@,B ,,17))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; `(,A ,@(SPAM UND EGGS) ,17)</span>

(<span class="org-keyword">let</span> ((b '(spam und eggs)))
 ``(,A ,,@B ,,17))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; `(,A ,SPAM ,UND ,EGGS ,17)</span>

(<span class="org-keyword">let</span> ((b '(spam und eggs)))
 ``(,A ,,B ,,17))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; `(,A ,(SPAM UND EGGS) ,17)</span>

(<span class="org-keyword">let</span> ((b '(spam und eggs)))
 ``(,A ,',B ,,17))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; `(,A ,'(SPAM UND EGGS) ,17)</span>

(<span class="org-keyword">let</span> ((b '(spam und eggs)))
 ``(,A ,@',B ,,17))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; `(,A ,@'(SPAM UND EGGS) ,17)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-h-6c738640-21a3-4a1c-8ad3-18cd9fbb1faa" class="outline-2">
<h2 id="h-6c738640-21a3-4a1c-8ad3-18cd9fbb1faa"><span class="section-number-2">4.</span> Caution: Compiler Dependence</h2>
<div class="outline-text-2" id="text-h-6c738640-21a3-4a1c-8ad3-18cd9fbb1faa">
<p>
In SBCL 2.2.4.46-d4779571f, we see in the REPL:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">SBCL</span>
(caadr (<span class="org-keyword">let</span> ((b '(spam und eggs))) ``(,A ,@',B ,,17)))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; ,A</span>

(type-of (caadr (<span class="org-keyword">let</span> ((b '(spam und eggs))) ``(,A ,@',B ,,17))))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; SB-IMPL::COMMA</span>

(cadadr (<span class="org-keyword">let</span> ((b '(spam und eggs))) ``(,A ,@',B ,,17)))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; ,@'(SPAM UND EGGS)</span>

(type-of (cadadr (<span class="org-keyword">let</span> ((b '(spam und eggs))) ``(,A ,@',B ,,17))))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; SB-IMPL::COMMA</span>
</pre>
</div>

<p>
This is because SBCL has an optimized internal backquote facility, with
comma expressions. For example, in SBCL, we could obtain all the
"comma'd expressions" by:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">SBCL</span>
(remove-if-not #'sb-int::comma-p
 (alexandria:flatten
   (<span class="org-keyword">let</span> ((b '(spam und eggs))) ``(,A ,@',B ,,17))))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; (,A ,@'(SPAM UND EGGS) ,17)</span>
</pre>
</div>

<p>
In CCL 1.12.1, we find double backquotes produce "equivalent" output to
what we'd naively expect:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">CCL repl</span>
(<span class="org-keyword">let</span> ((b '(spam und eggs)))
  ``(,A ,@',B ,,17))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; (LIST* A (APPEND '(SPAM UND EGGS) (LIST 17)))</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-h-203674ea-a03f-45bf-9a94-6cb8bdc77f2e" class="outline-2">
<h2 id="h-203674ea-a03f-45bf-9a94-6cb8bdc77f2e"><span class="section-number-2">5.</span> References</h2>
<div class="outline-text-2" id="text-h-203674ea-a03f-45bf-9a94-6cb8bdc77f2e">
<ul class="org-ul">
<li>Alan Bawden,<br>
"Quasiquotation in Lisp".<br>
<a href="https://3e8.org/pub/scheme/doc/Quasiquotation%20in%20Lisp%20(Bawden).pdf">PDF</a>.</li>
<li><i>Common Lisp The Language</i>,
<a href="https://www.cs.cmu.edu/Groups/AI/html/cltl/clm/node190.html#BACKQUOTE">Ch21 &sect;1.3</a>.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated: Mon, 14 Aug 2023 17:22:02 -0700
</div>
</body>
</html>
